{
  "general": "<h1>Thrive Messenger Help</h1><p>Thrive Messenger supports multi-server chat, accessible keyboard workflows, and admin tooling from one client. Press F1 in any window for context help. Press Escape or Command+W to close help and return.</p><p>Use the menu bar or context menus for all major actions: contacts, chats, file transfers, server management, bot rules, and updates.</p>",
  "login": "<h1>Login and Server Selection</h1><p>Choose a server from the Server list, then enter username and password to sign in. Use Manage Servers to add, edit, remove, and set a primary server entry.</p><p>Auto-login uses saved credentials and the selected server profile. If login fails, confirm server host/port/TLS values in Administration settings.</p>",
  "main": "<h1>Contacts Window</h1><p>The main window provides contacts, search, status controls, user directory, server info, server manager, settings, and updates. Context menus and menu actions mirror button actions for keyboard-first use.</p><ul><li>Start Chat: Return or menu action</li><li>Send File: Alt+F or menu action</li><li>User Directory: browse and filter users across configured servers</li><li>File Transfers: view sent/received files and saved locations</li></ul>",
  "chat": "<h1>Chat Window</h1><p>Default key behavior is Enter to send, Command+Enter for new line, and Control+Enter to send a file. Enter action can be changed in Settings.</p><p>Chat history is keyboard-navigable and can be logged based on global and per-contact rules. Typing indicators and message readout are configurable for accessibility.</p>",
  "directory": "<h1>User Directory</h1><p>Directory shows Everyone, Online, Offline, and Admins tabs with sort/filter options and server labels. Duplicate usernames across servers are displayed as separate entries.</p><p>If cross-server directory messaging is enabled in Administration settings, you can start a direct message to users on configured remote servers. When duplicates exist, the client lets you choose the target server user and remembers that default until you choose another.</p>",
  "admin": "<h1>Administration</h1><p>Server Side Commands supports command-based administration such as alerts, account actions, and scheduled restart. Command responses are stored in an accessible history list for arrow-key review.</p><p>Administration also provides bot rules management and server/update configuration. Unauthorized actions return explicit server-side errors.</p>",
  "settings": "<h1>Settings</h1><p>Settings are split into General, Audio, and Administration tabs. Configure sound packs, volume, accessibility behavior, chat key behavior, and layout preferences.</p><p>Administration settings include server host/port/TLS, update feed/repo fallback, restart scheduling, and toggle for cross-server directory direct messaging.</p>",
  "server_info": "<h1>Server Info</h1><p>Server Info reports active server name, host, port, encryption state, online users/admins, uptime, and file policy limits.</p><p>Use this view for quick diagnostics to confirm the active connection and server policy before troubleshooting.</p>",
  "bot_rules": "<h1>Bot Rules Manager</h1><p>Bot Rules Manager supports load, edit, save, and reset per bot. Global baseline rules can come from an agent ZIP/file ruleset, and admin overrides are stored per admin scope.</p><p>Admins can edit and reset rules. Non-admin users can request and view active rules in read-only mode.</p>"
}
